Revit 2016 API
TextNode.Position Property
 Position of the text (in model coordinates.)
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Since: 2016
Syntax
C#
public XYZ Position { get; }
Visual Basic
Public ReadOnly Property Position As XYZ
	Get
Visual C++
public:
property XYZ^ Position {
	XYZ^ get ();
}
See Also
TextNode Class
Autodesk.Revit.DB Namespace